"""
Задание 3.
Определить количество различных (уникальных) подстрок
с использованием хеш-функции
Дана строка S длиной N, состоящая только из строчных латинских букв
Подсказка: вы должны в цикле для каждой подстроки вычислить хеш
Все хеши записываем во множество.
Оно отсечет дубли.
Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.
Пример:
рара - 6 уникальных подстрок
рар
ра
ар
ара
р
а
"""
from hashlib import sha256 as sha

a = input()
m = set()
l = len(a)
for i in range(l):
    for j in range(i + 1, l + 1):
        m.add(sha(a[i:j].encode()).hexdigest())
        m.discard(sha(a.encode()).hexdigest())

