"""
Задание 1.
Пользователь вводит данные о количестве предприятий,
их наименования и прибыль за 4 квартала
(т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего
Подсказка:
Для решения задачи обязательно примените коллекцию из модуля collections
Для лучшего освоения материала можете сделать
несколько варианто решения этого задания,
применив несколько коллекций из модуля collections
Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235
Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34
Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога
Предприятия, с прибылью ниже среднего значения: Копыта
3
qwerty
12 34 56 78
op
98 76 54 32
jk
12 23 34 45
"""
from collections import defaultdict
n = int(input())
d = defaultdict(int)
for i in range(n):
    company = input()
    profit = list(map(int, input().split()))
    profit = sum(profit)/4
    d[company] += profit
for k in list(d.keys()):
    if d[k] > sum(d.values()) / n:
        print(k, " - выше среднего значения")
    elif d[k] < sum(d.values()) / n:
        print(k, " - ниже среднего значения")

